[{"id":"1648732973875","title":"Difference between AI & ML","content":"Artificial intelligence is a technology that enables a machine to simulate human behavior. Machine learning is a subset of AI which allows a machine to automatically learn from past data without programming explicitly. The goal of AI is to make a smart computer system like humans to solve complex problems. \r\n\r\nThe goal of ML is to allow machines to learn from data so that they can give accurate output. In AI, we make intelligent systems to perform any task like a human. In ML, we teach machines with data to perform a particular task and give an accurate result. \r\n\r\n Machine learning,is a type of artificial intelligence, where artificial intelligence is the overall appearance of being smart, machine learning is where machines are taking in data and learning things about the world that would be difficult for humans to do. ML can go beyond human intelligence. ML is primarily used to process large quantities of data very quickly using algorithms that change over time and get better at what they’re intended to do.\r\n\r\n\r\n","post_image":"./assets1/post-image-1648732972883.jpg","added_date":"1648732973875"},{"id":"1648732612783","title":"Why one should learn coding?","content":"Learning to program also makes your attention to detail skyrocket. After all, when a single misplaced hyphen or missing period can mess up your entire code, you become quite skilled at checking your work (not to mention, doing things right the first time!).\r\nProblem-solving skill is the heart of programming and learning programming is about breaking up problems into smaller chunks, using your own logic and algorithms to create a program and then giving a solution for that. Coding forces your brain to think about a problem deeply, organize your thoughts for the same, apply some logic and then providing a solution. Every time you face a new challenge, you need to use your brain, you may have to make your own rule and you need to follow a logical approach.","post_image":"./assets1/post-image-1648732612250.jpg","added_date":"1648732612783"},{"id":"1648732295874","title":"Html ","content":"HTML basics\r\nHTML is the code that is used to structure a web page and its content. For example, content could be structured within a set of paragraphs, a list of bulleted points, or using images and data tables. As the title suggests, this article will give you a basic understanding of HTML and its functions.\r\n\r\nwhat is HTML?\r\nHTML is a markup language that defines the structure of your content. HTML consists of a series of elements, which you use to enclose, or wrap, different parts of the content to make it appear a certain way, or act a certain way. The enclosing tags can make a word or image hyperlink to somewhere else, can italicize words, can make the font bigger or smaller, and so on.\r\n","post_image":"./assets1/post-image-1648732295765.jpg","added_date":"1648732295875"},{"id":"1581376324100","title":"I LOVE JavaScript","content":"I have been using JavaScript since the beginning of my coding career!\nI used it to build simple websites and I used it to build large scale applications!  \nNow I use it to teach others, as well as create large applications. The possibilities of this language are endless, and the use cases keep increasing every single day! ","post_image":"assets1/post-image-js.png","added_date":"1581376324100"}]